Documents/DMS_ОбращениеКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>DMS_ОбращениеКлиента</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбращения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_СтатусыОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбращения</Name>
					<Comment>Тип обращения клиента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ТипыОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_СтатусыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НашеОбращениеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НашеОбращениеПричина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодТипОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПодТипыОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязаннаяЗаявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_ОбращениеКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подробности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПодробностиОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОщущениеКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ОщущенияКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПожеланиеКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПожеланияКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Риск</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Риски</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроблемнаяСистемаАвто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПроблемныеСистемыАвто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДетализацияПроблемыКачества</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ДетализацииПроблемКачества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроблемаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПроблемыПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерПроблемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ХарактерыПроблемПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовтороноеПриобретенияАвто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектацияАвто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьРешения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроисхождениеОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПроисхожденияОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗакрытияОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПричиныЗакрытияОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроблемаПослеПродажногоОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПроблемыПослеПродажногоОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрохождениеТО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ПрохождениеТО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеДопОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатныеРемонты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовтороноеПриобретенияАвтоRenault</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПродажиАвто</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеАвто</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СостоянияАвто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбращенияВДЦ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФункциональныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РепутационныеРиски</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическиеРиски</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗКП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_ЗапросНаКоммерческуюПомощь</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДействияПоОбращению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_ДействияПоОбращениям</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПланируемая</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполнениеПросрочено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтметкаВыполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОбращение</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияОбщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сообщение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСообщения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Renault_ПользователиИШаблоныПравИНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ПользователиИШаблоныПравИНастроек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваИНастройки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПраваИНастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонсигнации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаОкончанияОтсрочкиОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГаражныйНомер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретНаВнутренниеПерепродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/DMS_ОбращениеКлиента/Forms/ФормаДокументаУпр/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОткрытьКартинкиИФайлы(Команда)
	Парам = Новый Структура("Отбор",новый Структура("Объект", Объект.Ссылка));
	ОткрытьФорму("РегистрСведений.КартинкиИФайлы.ФормаСписка",Парам,ЭтаФорма,ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ДействияПоОбращениюПередУдалением(Элемент, Отказ)
	Если Не ДоступноПравоНаКлиенте("ПолныеПрава")
		и ПроверитьНаВозможностьИзмененияСтроки(Элемент.ТекущиеДанные.НомерСтроки,Объект.Ссылка) тогда
		Сообщить("Удалять действия может только пользователь с полными правами");
		Отказ = Истина;
	иначе
		Если Элемент.ТекущиеДанные.НомерСтроки > 1 Тогда
			ПредЭлемент = Объект.ДействияПоОбращению.Получить(Элемент.ТекущиеДанные.НомерСтроки-2);
			ПредЭлемент.ДатаВыполнения = Дата(1,1,1);
			ПредЭлемент.ОтметкаВыполнения = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступнаРоль(Роль);
	Возврат РольДоступна(Роль);
КонецФункции

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)
	
	ЗаполнитьЗначенияСвойств(Объект,ПолучитьДанныеПоАвтомобилюНаСервере(Объект.Автомобиль, Объект.Дата));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоАвтомобилюНаСервере(Автомобиль,ДатаДок)
	
	СтруктураДанных = Новый Структура();
	
	Если НачалоДня(Автомобиль.ДатаОкончанияГарантии) > ДатаДок тогда
		СтруктураДанных.Вставить("Гарантия",Истина);
	Иначе
		СтруктураДанных.Вставить("Гарантия",Ложь);
	КонецЕсли;
	
	СтруктураДанных.Вставить("Пробег",Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег));
	СтруктураДанных.Вставить("ГосНомер",Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер));
	СтруктураДанных.Вставить("VIN",Автомобиль.VIN);
	СтруктураДанных.Вставить("КомплектацияАвто",Автомобиль.ВариантКомплектации);
	СтруктураДанных.Вставить("Модель",Автомобиль.Модель);
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиАвтомобильПоVINНаСервере(VIN)
	
	Возврат Справочники.Автомобили.НайтиПоРеквизиту("VIN",VIN);
	
КонецФункции

&НаКлиенте
Процедура VINПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Автомобиль) и ЗначениеЗаполнено(Объект.VIN) тогда
		Объект.Автомобиль = НайтиАвтомобильПоVINНаСервере(Объект.VIN);
		Если ЗначениеЗаполнено(Объект.Автомобиль) тогда
		 	ЗаполнитьЗначенияСвойств(Объект,ПолучитьДанныеПоАвтомобилюНаСервере(Объект.Автомобиль, Объект.Дата));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.Контрагент) и ЗначениеЗаполнено(Объект.Телефон)  тогда
		Объект.Контрагент = НайтиКлиентаПоТелефонуНаСервере(Объект.Телефон);
		ПриИзмененииКонтрагента();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
функция ПроверкаВыполнениеПросрочено(Действие,ДатаПланируемая, ДатаВыполнения)
	
	Если ЗначениеЗаполнено(Действие.ДлительностьДействия) тогда
	
		ДатаОкончания = ДатаПланируемая + Час(Действие.ДлительностьДействия) * 60 * 60 + Минута(Действие.ДлительностьДействия) * 60 + Секунда(Действие.ДлительностьДействия);	
		
		Если ДатаОкончания < ДатаВыполнения тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;	
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиКлиентаПоТелефонуНаСервере(Телефон)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	 Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ОсновнойТелефон ПОДОБНО &Телефон";
	
	Запрос.УстановитьПараметр("Телефон", "%"+Прав(Телефон,6)+"%");  // поиск по последним 6 цифрам номера
	
	Выборка= Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	иначе 
		//поищем в регистре контактная информация 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Представление ПОДОБНО &Телефон
		|	И КонтактнаяИнформация.Тип = &Тип";
		
		Запрос.УстановитьПараметр("Телефон", "%"+Прав(Телефон,6)+"%");  // поиск по последним 6 цифрам номера
		Запрос.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() тогда
			Возврат Выборка.Объект;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ДействияПоОбращениюПриИзменении(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДатаПланируемая) тогда
		Элемент.ТекущиеДанные.ДатаПланируемая = ТекущаяДата()+60*1;
	КонецЕсли;
	
	
	Если Элемент.ТекущиеДанные.НомерСтроки > 1 Тогда
		ПредЭлемент = Объект.ДействияПоОбращению.Получить(Элемент.ТекущиеДанные.НомерСтроки-2);
		Если НЕ ЗначениеЗаполнено(ПредЭлемент.ДатаВыполнения) тогда 
			ПредЭлемент.ДатаВыполнения = ТекущаяДата();
			ПредЭлемент.ОтметкаВыполнения = Истина;
		КонецЕсли;
		ПредЭлемент.ВыполнениеПросрочено = ПроверкаВыполнениеПросрочено(ПредЭлемент.Действие,ПредЭлемент.ДатаПланируемая, ПредЭлемент.ДатаВыполнения);
	КонецЕсли;
	
	Объект.СтатусОбращения = ПолучитьСтатусОбращенияДляДействия(Элемент.ТекущиеДанные.Действие, Объект.СтатусОбращения);
	
	
		
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ВернутьСсылкуНаПраво(ИмяПрава)
	Возврат Справочники.DMS_ПраваРолейПоОбращениям[ИмяПрава];
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтатусОбращенияДляДействия(Действие, ТекСтатус)
	
	Если Действие = Справочники.DMS_ДействияПоОбращениям.НазначитьВизитКлиента 
		или Действие = Справочники.DMS_ДействияПоОбращениям.СвязатьсяСКлиентом
		или Действие = Справочники.DMS_ДействияПоОбращениям.РешитьВопросПоОбращению
		или Действие = Справочники.DMS_ДействияПоОбращениям.Согласовано
		тогда
		Возврат Перечисления.DMS_СтатусыОбращения.ВРаботе;
	ИначеЕсли Действие = Справочники.DMS_ДействияПоОбращениям.ЗакрытьОбращение тогда
		Возврат Перечисления.DMS_СтатусыОбращения.Решено;
	ИначеЕсли Действие = Справочники.DMS_ДействияПоОбращениям.СогласоватьОбращение тогда
		Возврат Перечисления.DMS_СтатусыОбращения.НаСогласовании;
	ИначеЕсли Действие = Справочники.DMS_ДействияПоОбращениям.НазначитьИсполнителя
		или Действие = Справочники.DMS_ДействияПоОбращениям.ВзятьВРаботу тогда
		Возврат Перечисления.DMS_СтатусыОбращения.Открыто;
	КонецЕсли;
	
	Возврат ТекСтатус;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьНаВозможностьИзмененияСтроки(НомерСтроки,Ссылка)
	
	Если НомерСтроки <= Ссылка.ДействияПоОбращению.Количество() тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
 
КонецФункции

&НаСервереБезКонтекста
Функция ВернутьТекущегоСотрудника();
	
	Возврат Справочники.Пользователи.НайтиПоКоду(ПользователиИнформационнойБазы.ТекущийПользователь().Имя).Сотрудник;
	
КонецФункции

&НаСервере
Функция ПроверкаПрав()
	
	
	
Возврат Ложь;	
	
КонецФункции


&НаСервере
Функция ДоступноПраво(НазваниеПрава) Экспорт
	
	ПараметрОтбора = Новый Структура("ИмяПрава","ПолныеПрава");
	Если НаборПравПользователя.НайтиСтроки(ПараметрОтбора).Количество() > 0 тогда 
		Возврат Истина;
	Иначе
		ПараметрОтбора = Новый Структура("ИмяПрава",НазваниеПрава);
		Если НаборПравПользователя.НайтиСтроки(ПараметрОтбора).Количество() > 0 тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции


&НаСервере
Процедура НастройкаДоступностиФормы(Отказ)
 	
	
	
	Если НЕ ДоступноПраво("ПравоНаПросмотр")
		и НЕ ДоступноПраво("ПравоНаРедактирование")
		тогда
		Сообщить("Недостаточно прав для создания и просмотра обращения клиента!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ДоступноПраво("ПравоНаПросмотр")
		и НЕ ДоступноПраво("ПравоНаРедактирование")
		тогда
		Если Объект.Ссылка.Пустая() тогда
			Сообщить("Недостаточно прав для создания обращения клиента");
 		 	Отказ = Истина;
			Возврат;
		иначе
			ЭтаФорма.ТолькоПросмотр = Истина;
			Элементы.ДействияПоОбращениюАРМ_Автосервис.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЭтаФорма.ТолькоПросмотр Тогда
	   Если Объект.СтатусОбращения = Перечисления.DMS_СтатусыОбращения.Закрыто и НЕ ДоступноПраво("ПравоНаЗакрытие") тогда
			ЭтаФорма.ТолькоПросмотр = Истина;
			Элементы.ДействияПоОбращениюАРМ_Автосервис.Доступность = Ложь;
	   КонецЕсли;   
	КонецЕсли;
	
	Если Не ЭтаФорма.ТолькоПросмотр Тогда
		Если Объект.ТипОбращения = Справочники.DMS_ТипыОбращений.Гарантия тогда
			ЭтаФорма.ТолькоПросмотр = НЕ ДоступноПраво("ТипОбращенияГарантия");
			Элементы.ДействияПоОбращениюАРМ_Автосервис.Доступность = НЕ ЭтаФорма.ТолькоПросмотр;
		ИначеЕсли Объект.ТипОбращения = Справочники.DMS_ТипыОбращений.Сервис тогда
			ЭтаФорма.ТолькоПросмотр = НЕ ДоступноПраво("ТипОбращенияСервис");
			Элементы.ДействияПоОбращениюАРМ_Автосервис.Доступность = НЕ ЭтаФорма.ТолькоПросмотр;
		ИначеЕсли Объект.ТипОбращения = Справочники.DMS_ТипыОбращений.Продажа тогда
			ЭтаФорма.ТолькоПросмотр = НЕ ДоступноПраво("ТипОбращенияПродажа");
			Элементы.ДействияПоОбращениюАРМ_Автосервис.Доступность = НЕ ЭтаФорма.ТолькоПросмотр;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьНаборПравПользователя()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ПраваИНастройкиПользователейОбращенияКлиентов.Право,
		|	Renault_ПраваИНастройкиПользователейОбращенияКлиентов.Право.Код КАК ИмяПрава
		|ИЗ
		|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_ПраваИНастройкиПользователей.ОбращенияКлиентов КАК Renault_ПраваИНастройкиПользователейОбращенияКлиентов
		|		ПО Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки = Renault_ПраваИНастройкиПользователейОбращенияКлиентов.Ссылка
		|			И (Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь)
		|			И (Renault_ПраваИНастройкиПользователейОбращенияКлиентов.Доступность = ИСТИНА)
		|ГДЕ
		|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Справочники.Пользователи.НайтиПоКоду(ПользователиИнформационнойБазы.ТекущийПользователь().Имя));
	
	НаборПравПользователя.Загрузить(Запрос.Выполнить().Выгрузить());
	Для Каждого стр из НаборПравПользователя цикл
		Стр.ИмяПрава = Справочники.DMS_ПраваРолейПоОбращениям.ПолучитьИмяПредопределенного(Стр.Право);
	КонецЦикла;
	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьНаборПравПользователя();
	
	НастройкаДоступностиФормы(Отказ);
	УстановитьВидимостьПолейПоТипуОбращения();
	//Начальное заполнение
	Если Объект.Ссылка.Пустая() тогда
		
		Объект.СтатусОбращения = Перечисления.DMS_СтатусыОбращения.Открыто;
		Объект.Дата = ТекущаяДата();
		стрДействия = Объект.ДействияПоОбращению.Добавить();
		стрДействия.Действие = Справочники.DMS_ДействияПоОбращениям.НазначитьИсполнителя;
		стрДействия.ДатаПланируемая = Объект.Дата;
		стрДействия.Исполнитель = Справочники.Пользователи.НайтиПоКоду(ПользователиИнформационнойБазы.ТекущийПользователь().Имя).Сотрудник;
		Объект.Приоритет = Справочники.DMS_Приоритет.Нормальный;
		
		Если Параметры.Свойство("Автомобиль") Тогда
			ЗаполнитьЗначенияСвойств(Объект, Параметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьНашеПоследнееОбращение(МассивКлиентов); 
	
	СтруктураВозврата = Новый Структура("Дата,Причина");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_Трафик.Период КАК Дата,
	               |	NULL КАК Ид,
	               |	Renault_Трафик.ТипТрафика КАК Событие,
	               |	"""" КАК Примечание,
	               |	Renault_Трафик.Менеджер
	               |ИЗ
	               |	РегистрСведений.Renault_Трафик КАК Renault_Трафик
	               |ГДЕ
	               |	Renault_Трафик.Клиент В(&МассивКлиентов)
	               |	И Renault_Трафик.Отдел.ПродажаАвтомобилей = ИСТИНА
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Renault_РабочиеЛисты.ДатаID,
	               |	Renault_РабочиеЛисты.IDK,
	               |	""Рабочий лист"",
	               |	"""",
	               |	Renault_РабочиеЛисты.Сотрудник
	               |ИЗ
	               |	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	               |ГДЕ
	               |	Renault_РабочиеЛисты.Клиент В(&МассивКлиентов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	CRM_КоммерческоеПредложениеСостав.Ссылка.Дата,
	               |	CRM_КоммерческоеПредложениеСостав.Ссылка,
	               |	""Коммерческое предложение"",
	               |	CRM_КоммерческоеПредложениеСостав.Конфигурация.Модель,
	               |	Renault_РабочиеЛисты.Сотрудник
	               |ИЗ
	               |	Документ.CRM_КоммерческоеПредложение.Состав КАК CRM_КоммерческоеПредложениеСостав
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	               |		ПО CRM_КоммерческоеПредложениеСостав.Ссылка.РабочийЛист = Renault_РабочиеЛисты.IDK
	               |ГДЕ
	               |	Renault_РабочиеЛисты.Клиент В(&МассивКлиентов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	CRM_ЗаписиНаТестДрайв.ДатаНачала,
	               |	CRM_ЗаписиНаТестДрайв.IDK,
	               |	""Тест-драйв"",
	               |	CRM_ЗаписиНаТестДрайв.Автомобиль.Модель,
	               |	Renault_РабочиеЛисты.Сотрудник
	               |ИЗ
	               |	РегистрСведений.CRM_ЗаписиНаТестДрайв КАК CRM_ЗаписиНаТестДрайв
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	               |		ПО CRM_ЗаписиНаТестДрайв.IDK = Renault_РабочиеЛисты.IDK
	               |ГДЕ
	               |	Renault_РабочиеЛисты.Клиент В(&МассивКлиентов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Renault_Договор.Дата,
	               |	Renault_Договор.Ссылка,
	               |	""Договор на продажу а/м"",
	               |	Renault_Договор.СтатусДоговора,
	               |	Renault_РабочиеЛисты.Сотрудник
	               |ИЗ
	               |	Документ.Renault_Договор КАК Renault_Договор
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	               |		ПО Renault_Договор.РабочийЛист = Renault_РабочиеЛисты.IDK
	               |ГДЕ
	               |	Renault_РабочиеЛисты.Клиент В(&МассивКлиентов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ";				   
	Запрос.УстановитьПараметр("МассивКлиентов", МассивКлиентов);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		СтруктураВозврата.Дата = Выборка.Дата;
		СтруктураВозврата.Причина = Строка(Выборка.Событие);
	КонецЕсли;
	
	Возврат СтруктураВозврата; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ВернутьСписокКлиентовКонтрагента(Контрагент)
	
	СписокКлиентов = Новый СписокЗначений;
	СписокКлиентов.Добавить(Контрагент);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Renault_ПрофилиКлиентовКлиенты1.Клиент КАК Контрагент
		|ИЗ
		|	Справочник.Renault_ПрофилиКлиентов.Клиенты КАК Renault_ПрофилиКлиентовКлиенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_ПрофилиКлиентов.Клиенты КАК Renault_ПрофилиКлиентовКлиенты1
		|		ПО Renault_ПрофилиКлиентовКлиенты.Ссылка = Renault_ПрофилиКлиентовКлиенты1.Ссылка
		|ГДЕ
		|	Renault_ПрофилиКлиентовКлиенты.Клиент = &Клиент";
	
	Запрос.УстановитьПараметр("Клиент", Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокКлиентов.Добавить(Выборка.Контрагент);
	КонецЦикла;
	
Возврат СписокКлиентов;	
	
КонецФункции

&НаКлиенте
Процедура АвтомобильНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Клиент", Объект.Контрагент);
	ОткрытьФорму("Документ.DMS_ОбращениеКлиента.Форма.ФормаВыбораАвтомобиля", ПараметрыОткрытия);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьКоличествоАвтомобилейКонтрагента(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АвтомобилиСрезПоследних.Автомобиль.Ссылка КАК Автомобиль
	               |ИЗ
	               |	РегистрСведений.Автомобили.СрезПоследних(, ) КАК АвтомобилиСрезПоследних
	               |ГДЕ
	               |	АвтомобилиСрезПоследних.ВидЗначения = &ВидЗначения
	               |	И АвтомобилиСрезПоследних.Значение В(&СписокКлиентов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	АвтомобилиСрезПоследних.Период УБЫВ";
				   
				   
	Запрос.УстановитьПараметр("СписокКлиентов", ВернутьСписокКлиентовКонтрагента(Контрагент));
	Запрос.УстановитьПараметр("ВидЗначения", Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин);
	
	
	Количество = Запрос.Выполнить().Выгрузить().Количество();
	Возврат Количество;
	

КонецФункции

&НаКлиенте
Процедура ЗаполнитьКоличествоАвтомобилейКонтрагента()
	Если ЗначениеЗаполнено(Объект.Контрагент) тогда
		КоличествоАвтомобилей = ВернутьКоличествоАвтомобилейКонтрагента(Объект.Контрагент);
		Если КоличествоАвтомобилей>0 тогда
			ЭтаФорма.Элементы.Автомобиль.Заголовок = "Автомобиль (" + Строка(КоличествоАвтомобилей)+") ";
		КонецЕсли;
	КонецЕсли;     	
КонецПроцедуры


&НаКлиенте
Процедура ПриИзмененииКонтрагента()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) тогда
		ЗаполнитьЗначенияСвойств(Объект,ПолучитьДанныеКонтрагента(Объект.Контрагент));
		ЗаполнитьКоличествоАвтомобилейКонтрагента();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеКонтрагента(Контрагент)
	Возврат DMS_ОбращенияКлиентов.ПолучитьДанныеКонтрагентаНаСервере(Контрагент)
КонецФункции

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ПриИзмененииКонтрагента();
	
КонецПроцедуры

&НаКлиенте
Функция ДоступноПравоНаКлиенте(НазваниеПрава);
	
	ПараметрОтбора = Новый Структура("ИмяПрава","ПолныеПрава");
	Если НаборПравПользователя.НайтиСтроки(ПараметрОтбора).Количество() = 1 тогда 
		Возврат Истина;
	Иначе
		ПараметрОтбора = Новый Структура("ИмяПрава",НазваниеПрава);
		Если НаборПравПользователя.НайтиСтроки(ПараметрОтбора).Количество() = 1 тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции


&НаКлиенте
Процедура ДействияПоОбращениюПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущийЭлемент.Имя <> "ДействияПоОбращениюДокументОбращение" 
		И Элемент.ТекущаяСтрока + 1  < Объект.ДействияПоОбращению.Количество()
		Тогда
		Если Не ДоступноПравоНаКлиенте("ПолныеПрава") 
			и ПроверитьНаВозможностьИзмененияСтроки(Элемент.ТекущиеДанные.НомерСтроки, Объект.Ссылка) тогда
			Сообщить("Редактировать выполненные действия можно только с полными правами");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияПоОбращениюПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока и Элемент.ТекущиеДанные <> Неопределено тогда
		Элемент.ТекущиеДанные.ДатаВыполнения = Дата(1,1,1);
		Объект.СтатусОбращения = ПолучитьСтатусОбращенияДляДействия(Элемент.ТекущиеДанные.Действие, Объект.СтатусОбращения);	
		Элемент.ТекущиеДанные.ОтметкаВыполнения = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеДляЗакрытияОбращенияНаСервере()
	СтруктураЗначений = Новый Структура();
	СтруктураЗначений.Вставить("Статус",Перечисления.DMS_СтатусыОбращения.Закрыто);
	СтруктураЗначений.Вставить("СтатусВРаботе",Перечисления.DMS_СтатусыОбращения.ВРаботе);
	СтруктураЗначений.Вставить("ДействиеЗакрытие",Справочники.DMS_ДействияПоОбращениям.ЗакрытьОбращение);
	СтруктураЗначений.Вставить("ДействиеСогласование",Справочники.DMS_ДействияПоОбращениям.СогласоватьОбращение);
	СтруктураЗначений.Вставить("ДействиеСогласовано",Справочники.DMS_ДействияПоОбращениям.Согласовано);
	СтруктураЗначений.Вставить("ДействиеСвязатьсяСКлиентом",Справочники.DMS_ДействияПоОбращениям.СвязатьсяСКлиентом);
	Возврат СтруктураЗначений;
КонецФункции

&НаКлиенте
Процедура ЗакрытиеОбращения(Команда)
	СтруктураЗначений = ДанныеДляЗакрытияОбращенияНаСервере();
	Если Объект.ДействияПоОбращению.Количество() > 0 тогда
		ПоследняСтрокаДействия = Объект.ДействияПоОбращению.Получить(Объект.ДействияПоОбращению.Количество()-1);
		Если ПоследняСтрокаДействия.Действие = СтруктураЗначений.ДействиеЗакрытие тогда	
			ПоследняСтрокаДействия.ДатаВыполнения = ТекущаяДата();
			ПоследняСтрокаДействия.ОтметкаВыполнения = Истина;
			Объект.СтатусОбращения = СтруктураЗначений.Статус;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АРМ_Автосервис(Команда)
	
	
	НовоеОбращение = Документы.Renault_CRM_ОбращениеВАвтоСервис.СоздатьДокумент();
	НовоеОбращение.Дата = ТекущаяДата();
	НовоеОбращение.Менеджер = ПараметрыСеанса.Пользователь;
	НовоеОбращение.ОбращениеОбработано = ИСТИНА;
	НовоеОбращение.Клиент = Объект.Контрагент;
	НовоеОбращение.ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Первичный;
	НовоеОбращение.Жалоба = Истина;
	НовоеОбращение.Записать();
		
		//НовыйДок = Документы.Renault_CRM_ЗаявкаНаСервис.СоздатьДокумент();
		//НовыйДок.Дата = ТекущаяДата();
		//НовыйДок.Клиент = ТекущийКонтрагент;
		//НовыйДок.Автор = ПараметрыСеанса.Пользователь.Сотрудник;
		//НовыйДок.Обращение = НовоеОбращение.Ссылка;
		
		
	Форма = Обработки.CRM_АРМ_АвтоСервис_2.ПолучитьФорму("Форма");
	
	Если Форма.Открыта() Тогда
		
		Форма.Закрыть();
		
		Форма = Обработки.CRM_АРМ_АвтоСервис_2.ПолучитьФорму("Форма");
		
	Иначе
		
	КонецЕсли;
	
	Форма.ВнешнийЗапрос(НовоеОбращение.Ссылка, Объект.Контрагент, Объект.Автомобиль);
	
	//Козлов Е.А. Начало 12.05.2016
	//Результат = Форма.ОткрытьМодально();
	//Козлов Е.А. Конец	
	//Возврат Результат;

	
	//НаборПараметров  = Новый Структура();
	//НаборПараметров.Вставить("Основание",Объект.Ссылка);
	//НаборПараметров.Вставить("Примечание","Создано на основании жалобы клиента " + Объект.Номер +" от " + Объект.Дата);
	//НаборПараметров.Вставить("ТекущийКлиент",Объект.Контрагент);
	//НаборПараметров.Вставить("ТекущийАвтомобиль",Объект.Автомобиль);
	//ФормаАРМ = Обработки.CRM_АРМ_АвтоСервис.ПолучитьФорму("Форма");
	//ФормаАРМ.Параметры = НаборПараметров;
	//ФормаАРМ.Открыть(); 

	////Парам = Новый Структура();
	////Парам.Вставить("Параметры",НаборПараметров);
	////ОткрытьФорму("Обработка.CRM_АРМ_АвтоСервис.Форма.Форма",Парам);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДействиеПоОбращениюНаСеревере(ИмяДействия);
	Возврат Справочники.DMS_ДействияПоОбращениям[ИмяДействия];
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "НазначеноВремяПриема" тогда
		Если Объект.Ссылка = Параметр.Основание тогда
			ТекСтрока = Объект.ДействияПоОбращению.Получить(Объект.ДействияПоОбращению.Количество()-1);
			ТекСтрока.ДатаВыполнения = ТекущаяДата();
			ТекСтрока.ОтметкаВыполнения = Истина;
			ТекСтрока.ДокументОбращение = Параметр.ДокументОбращение;
			Исполнитель = ТекСтрока.Исполнитель;
			НовСтрока = Объект.ДействияПоОбращению.Добавить();
			НовСтрока.Действие = ПолучитьДействиеПоОбращениюНаСеревере("ВизитКлиента"); 
			НовСтрока.ДатаПланируемая = Параметр.ДатаПриемки;
			НовСтрока.Исполнитель = Исполнитель;
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ВыбранАвтомобиль" тогда
		Объект.Автомобиль = Параметр.Автомобиль;
		ЗаполнитьЗначенияСвойств(Объект,ПолучитьДанныеПоАвтомобилюНаСервере(Объект.Автомобиль, Объект.Дата));
	ИначеЕсли ИмяСобытия = "АвтомобильИзменен" тогда
		Если Объект.Автомобиль = Параметр тогда
			Объект.Автомобиль = Параметр;
			ЗаполнитьЗначенияСвойств(Объект,ПолучитьДанныеПоАвтомобилюНаСервере(Объект.Автомобиль, Объект.Дата));
		КонецЕсли;
		ЗаполнитьКоличествоАвтомобилейКонтрагента();	
	ИначеЕсли ИмяСобытия = "ОбновитьКИ_КЛ" тогда
		 ПриИзмененииКонтрагента();
	ИначеЕсли ИмяСобытия = "ВыбранИсполнительДействия" тогда
		 Если Параметр.ВладелецФормы = ЭтаФорма тогда
		 	ТекСтрока = Объект.ДействияПоОбращению.Получить(Объект.ДействияПоОбращению.Количество()-1);
			ТекСтрока.Исполнитель = Параметр.Значение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНашеОбращение()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) тогда
		СтруктураДанных = ПолучитьНашеПоследнееОбращение(ВернутьСписокКлиентовКонтрагента(Объект.Контрагент));
		Объект.НашеОбращениеДата = СтруктураДанных.Дата;
		Объект.НашеОбращениеПричина = СтруктураДанных.Причина;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	Если Не ЭтаФорма.ТолькоПросмотр Тогда
		Если Объект.ДействияПоОбращению.Количество()>0 тогда
			СтруктураЗначений = ДанныеДляЗакрытияОбращенияНаСервере();
			ПоследняСтрокаДействия = Объект.ДействияПоОбращению.Получить(Объект.ДействияПоОбращению.Количество()-1);
			
			Элементы.СогласоватьОбращение.Доступность = Ложь;
			
			Если ПоследняСтрокаДействия.Действие = СтруктураЗначений.ДействиеЗакрытие тогда	
				Элементы.ЗакрытиеОбращения.Доступность = ДоступноПраво("ПравоНаЗакрытие");
				ЭтаФорма.ТолькоПросмотр = НЕ ДоступноПраво("ПравоНаЗакрытие");
				Элементы.ДействияПоОбращениюАРМ_Автосервис.Доступность = НЕ ЭтаФорма.ТолькоПросмотр;
			ИначеЕсли ПоследняСтрокаДействия.Действие = СтруктураЗначений.ДействиеСогласование тогда		
				МаксСтоимость = ПолучитьМаксСтоимость();
				Если МаксСтоимость > 0 и Объект.СтоимостьРешения > МаксСтоимость тогда 
					ЭтаФорма.ТолькоПросмотр = НЕ (ДоступноПраво("ПравоНаСогласование") и ДоступноПраво("СогласованиеОбращенияСВысокойСтоимостью"));
				иначе
					ЭтаФорма.ТолькоПросмотр = НЕ ДоступноПраво("ПравоНаСогласование");
				КонецЕсли;
				Элементы.ДействияПоОбращениюАРМ_Автосервис.Доступность = НЕ ЭтаФорма.ТолькоПросмотр;
				Элементы.СогласоватьОбращение.Доступность = НЕ ЭтаФорма.ТолькоПросмотр;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	

	
	ЗаполнитьКоличествоАвтомобилейКонтрагента();
	ЗаполнитьНашеОбращение();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМаксСтоимость()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ПраваИНастройкиПользователей.Обращения_ПределСуммыОбращения КАК МаксСтоимость
		|ИЗ
		|	РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_ПраваИНастройкиПользователей КАК Renault_ПраваИНастройкиПользователей
		|		ПО Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки = Renault_ПраваИНастройкиПользователей.Ссылка
		|			И (Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь)
		|ГДЕ
		|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Справочники.Пользователи.НайтиПоКоду(ПользователиИнформационнойБазы.ТекущийПользователь().Имя));
	
	выборка = Запрос.Выполнить().Выбрать();
	Если выборка.Следующий() тогда
		Возврат Выборка.МаксСтоимость;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьПрофильКлиента(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ПрофилиКлиентовКлиенты.Ссылка
		|ИЗ
		|	Справочник.Renault_ПрофилиКлиентов.Клиенты КАК Renault_ПрофилиКлиентовКлиенты
		|ГДЕ
		|	Renault_ПрофилиКлиентовКлиенты.Клиент = &Клиент";
	
	Запрос.УстановитьПараметр("Клиент", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		НовыйПрофиль = Справочники.Renault_ПрофилиКлиентов.СоздатьЭлемент();
		Клиент = НовыйПрофиль.Клиенты.Добавить();
		Клиент.Клиент = Контрагент;
		НовыйПрофиль.Записать();
		Возврат	НовыйПрофиль.Ссылка;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПрофильКлиента(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОткрытьЗначение(ПолучитьПрофильКлиента(Объект.Контрагент));
 	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьЖурналСобытий(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) тогда
		Отбор = новый Структура("РегистраторСобытия",Объект.Ссылка);
	 	П = Новый Структура();
		П.Вставить("Отбор",Отбор);
		ОткрытьФорму("РегистрСведений.dms_ЖурналСобытий.ФормаСписка",П);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПереключитьНаПодробности(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПодробности;
КонецПроцедуры


&НаКлиенте
Процедура ИсторияОбщенияПриИзменении(Элемент)
	
	Если Элемент.ТекущиеДанные<>Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Сотрудник) тогда
			Элемент.ТекущиеДанные.Сотрудник = ВернутьТекущегоСотрудника();
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДатаСообщения) тогда
			Элемент.ТекущиеДанные.ДатаСообщения = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СогласоватьОбращение(Команда)
	
	СтруктураЗначений = ДанныеДляЗакрытияОбращенияНаСервере();
	Если Объект.ДействияПоОбращению.Количество() > 0 тогда
		ПоследняСтрокаДействия = Объект.ДействияПоОбращению.Получить(Объект.ДействияПоОбращению.Количество()-1);
		Если ПоследняСтрокаДействия.Действие = СтруктураЗначений.ДействиеСогласование тогда	
			ПоследняСтрокаДействия.ДатаВыполнения = ТекущаяДата();
			ПоследняСтрокаДействия.ОтметкаВыполнения = Истина;
			Объект.СтатусОбращения = СтруктураЗначений.СтатусВРаботе;
			НовСтр = Объект.ДействияПоОбращению.Добавить();
			НовСтр.Действие = СтруктураЗначений.ДействиеСогласовано;
			НовСтр.Исполнитель = ВернутьТекущегоСотрудника(); 
			НовСтр.ДатаПланируемая = ТекущаяДата();
			НовСтр.ДатаВыполнения = ТекущаяДата();
			НовСтр.ОтметкаВыполнения = Истина;
			
			НовСтр = Объект.ДействияПоОбращению.Добавить();
			НовСтр.Действие = СтруктураЗначений.ДействиеСвязатьсяСКлиентом;
			НовСтр.Исполнитель = ВернутьТекущегоСотрудника(); 
			НовСтр.ДатаПланируемая = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДействияПоОбращениюДействиеПриИзменении(Элемент)
	
	Элементы.ЗакрытиеОбращения.Доступность = Ложь;
	Элементы.СогласоватьОбращение.Доступность = Ложь;
	
	Если Объект.ДействияПоОбращению.Количество()>0 тогда
		
		ПоследняСтрокаДействия = Объект.ДействияПоОбращению.Получить(Объект.ДействияПоОбращению.Количество()-1);
		
		Если ЗначениеЗаполнено(ПоследняСтрокаДействия.Действие) тогда
			//и НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Исполнитель) тогда
			СтруктураЗначений = ДанныеДляЗакрытияОбращенияНаСервере();
			
			СписокПрав = Новый СписокЗначений;
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("Ключ",Объект.Ссылка);
			
			Если ПоследняСтрокаДействия.Действие = СтруктураЗначений.ДействиеЗакрытие тогда	
				Элементы.ЗакрытиеОбращения.Доступность = ДоступноПравоНаКлиенте("ПравоНаЗакрытие");
				СписокПрав.Добавить(ВернутьСсылкуНаПраво("ПравоНаЗакрытие"));
				ПараметрыОткрытия.Вставить("СписокПрав",СписокПрав);
				ОткрытьФорму("Документ.DMS_ОбращениеКлиента.Форма.ФормаВыбораИсполнителя",ПараметрыОткрытия,ЭтаФорма,ЭтаФорма);
			ИначеЕсли ПоследняСтрокаДействия.Действие = СтруктураЗначений.ДействиеСогласование тогда	
				СписокПрав.Добавить(ВернутьСсылкуНаПраво("ПравоНаСогласование"));
				ПараметрыОткрытия.Вставить("СписокПрав",СписокПрав);
				ОткрытьФорму("Документ.DMS_ОбращениеКлиента.Форма.ФормаВыбораИсполнителя",ПараметрыОткрытия,ЭтаФорма,ЭтаФорма);
				Элементы.СогласоватьОбращение.Доступность = ДоступноПравоНаКлиенте("ПравоНаСогласование"); 	
			Иначе
				СписокПрав.Добавить(ВернутьСсылкуНаПраво("ПравоНаРедактирование"));
				ПараметрыОткрытия.Вставить("СписокПрав",СписокПрав);
				ОткрытьФорму("Документ.DMS_ОбращениеКлиента.Форма.ФормаВыбораИсполнителя",ПараметрыОткрытия,ЭтаФорма,ЭтаФорма);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ДействияПоОбращениюОтветственныйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоследняСтрокаДействия = Объект.ДействияПоОбращению.Получить(Объект.ДействияПоОбращению.Количество()-1);
		
		Если ЗначениеЗаполнено(ПоследняСтрокаДействия.Действие) тогда
			СтруктураЗначений = ДанныеДляЗакрытияОбращенияНаСервере();
			
			СписокПрав = Новый СписокЗначений;
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("Ключ",Объект.Ссылка);
			
			Если ПоследняСтрокаДействия.Действие = СтруктураЗначений.ДействиеЗакрытие тогда	
				Элементы.ЗакрытиеОбращения.Доступность = ДоступноПравоНаКлиенте("ПравоНаЗакрытие");
				СписокПрав.Добавить(ВернутьСсылкуНаПраво("ПравоНаЗакрытие"));
				ПараметрыОткрытия.Вставить("СписокПрав",СписокПрав);
				ОткрытьФорму("Документ.DMS_ОбращениеКлиента.Форма.ФормаВыбораИсполнителя",ПараметрыОткрытия,ЭтаФорма,ЭтаФорма);
			ИначеЕсли ПоследняСтрокаДействия.Действие = СтруктураЗначений.ДействиеСогласование тогда	
				СписокПрав.Добавить(ВернутьСсылкуНаПраво("ПравоНаСогласование"));
				ПараметрыОткрытия.Вставить("СписокПрав",СписокПрав);
				ОткрытьФорму("Документ.DMS_ОбращениеКлиента.Форма.ФормаВыбораИсполнителя",ПараметрыОткрытия,ЭтаФорма,ЭтаФорма);
				Элементы.СогласоватьОбращение.Доступность = ДоступноПравоНаКлиенте("ПравоНаСогласование"); 	
			Иначе
				СписокПрав.Добавить(ВернутьСсылкуНаПраво("ПравоНаРедактирование"));
				ПараметрыОткрытия.Вставить("СписокПрав",СписокПрав);
				ОткрытьФорму("Документ.DMS_ОбращениеКлиента.Форма.ФормаВыбораИсполнителя",ПараметрыОткрытия,ЭтаФорма,ЭтаФорма);
			КонецЕсли;
		КонецЕсли;
		
КонецПроцедуры


&НаКлиенте
Процедура ДействияПоОбращениюДокументОбращениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеВыбора) тогда 
		ОткрытьЗначение(ДанныеВыбора);
	КонецЕсли;
		
КонецПроцедуры


&НаСервере
Процедура ОтправитьОбращениеНаСервере()
	
	ТекстСообщения = СформироватьТекстСообщения();
				
	BIR = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	
	ТаблицаСообщений = Новый ТаблицаЗначений;
	ТаблицаСообщений.Колонки.Добавить("Получатели");
	ТаблицаСообщений.Колонки.Добавить("ТекстСообщения");
	ТаблицаСообщений.Колонки.Добавить("BIR");
						
	НоваяСтрока = ТаблицаСообщений.Добавить();
	НоваяСтрока.BIR = ?(ЗначениеЗаполнено(BIR),BIR,"99999999");
	НоваяСтрока.ТекстСообщения = ТекстСообщения;
			
	Получатели = Новый ТаблицаЗначений;
			
	Получатели.Колонки.Добавить("Адрес");	
	СтрокаПолучатели = Получатели.Добавить();
	СтрокаПолучатели.Адрес = "orfos_it@mail.ru";
	НоваяСтрока.Получатели = Получатели;
		
	DMS_ВзаимодействияСКлиентом.ВыполнитьРассылкуПисем(ТаблицаСообщений);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОбращение(Команда)
	ОтправитьОбращениеНаСервере();
КонецПроцедуры

&НаСервере
Функция СформироватьТекстСообщения()
	
	//ЗКП_<НомерДокументаОбращение>_<BIR Дилера>_<НазваниеДилера>_<ФИО_Клиента>
	//Символы.НПП разрыв
	
	BIR = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя(ПараметрыСеанса.Пользователь);
	
	ЗаголовокПисьма  = НСтр("ru='Запрос коммерческой помощи'")+"_"+Объект.Номер+"_"+BIR+"_"+ДЦ+"_"+Объект.Контрагент+"";
	ТекстСообщения = ЗаголовокПисьма  + Символы.ПС	+ "Содержимое письма";
	Возврат ТекстСообщения;
	
КонецФункции

&НаСервере
Функция СоздатьНаОснованииЗКПНаСервере()
	
	СсылкаДок = Документы.Renault_ЗапросНаКоммерческуюПомощь.ПолучитьСсылку(Новый УникальныйИдентификатор());	
	ЗапросНаКоммерческуюПомощь = Документы.Renault_ЗапросНаКоммерческуюПомощь.СоздатьДокумент();
	ЗапросНаКоммерческуюПомощь.УстановитьСсылкуНового(СсылкаДок);
	ЗапросНаКоммерческуюПомощь.УстановитьНовыйНомер();
	ЗапросНаКоммерческуюПомощь.Дата =  ТекущаяДата();
	ЗапросНаКоммерческуюПомощь.ТипКлиента = Перечисления.Renault_ТипыКлиентов.РозничныйКлиент;
	ЗапросНаКоммерческуюПомощь.Приоритет = Справочники.DMS_Приоритет.Нормальный;
	ЗапросНаКоммерческуюПомощь.СтатусЗапроса = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ПодготовкаДилером;
	ЗапросНаКоммерческуюПомощь.Ответственный = ПараметрыСеанса.Пользователь;
	
	ЗаполнитьЗначенияСвойств(ЗапросНаКоммерческуюПомощь,Объект,,"Номер");
	ДЦ = Renault_CRM.ПолучитьДилерскийЦентрПользователя(ПараметрыСеанса.Пользователь);
	ЗапросНаКоммерческуюПомощь.БизнесРегион = ДЦ.DMS_БизнесРегион;
	
	ЗапросНаКоммерческуюПомощь.Записать(РежимЗаписиДокумента.Проведение);
	
	Объект.ЗКП = СсылкаДок;
	Записать();
	
	Возврат СсылкаДок;
		
КонецФункции

&НаКлиенте
Процедура СоздатьНаОснованииЗКП(Команда)
	Если ЗначениеЗаполнено(Объект.ЗКП) Тогда
		 ОткрытьЗначение(Объект.ЗКП);
	Иначе
		СсылкаДок = СоздатьНаОснованииЗКПНаСервере();
		ОткрытьЗначение(СсылкаДок);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДействияПоОбращениюДатаВыполненияПриИзменении(Элемент)
	ТекСтрока = Элементы.ДействияПоОбращению;
	Если ТекСтрока.ТекущиеДанные<>Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ТекущиеДанные.Сотрудник) тогда
			ТекСтрока.ТекущиеДанные.Сотрудник = ВернутьТекущегоСотрудника();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипОбращенияПриИзменении(Элемент)
	УстановитьВидимостьПолейПоТипуОбращения();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолейПоТипуОбращения ()
	Если Объект.ТипОбращения = Справочники.DMS_ТипыОбращений.Продажа ИЛИ Объект.ТипОбращения = Справочники.DMS_ТипыОбращений.Запчасти Тогда
		Элементы.ПроблемаПослеПродажногоОбслуживания.Видимость = Ложь;
		Элементы.ПроблемаПродаж.Видимость = Истина;
		Если ЗначениеЗаполнено(Объект.ПроблемаПослеПродажногоОбслуживания) Тогда
			Объект.ПроблемаПослеПродажногоОбслуживания = Справочники.DMS_ПроблемыПослеПродажногоОбслуживания.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли Объект.ТипОбращения = Справочники.DMS_ТипыОбращений.Сервис ИЛИ Объект.ТипОбращения = Справочники.DMS_ТипыОбращений.Гарантия Тогда
		Элементы.ПроблемаПродаж.Видимость = Ложь;
		Элементы.ПроблемаПослеПродажногоОбслуживания.Видимость = Истина;
		Если ЗначениеЗаполнено(Объект.ПроблемаПродаж) Тогда
			Объект.ПроблемаПродаж = Справочники.DMS_ПроблемыПослеПродажногоОбслуживания.ПустаяСсылка();
		КонецЕсли;		
	Иначе
		Элементы.ПроблемаПродаж.Видимость = Ложь;
		Если ЗначениеЗаполнено(Объект.ПроблемаПродаж) Тогда
			Объект.ПроблемаПродаж = Справочники.DMS_ПроблемыПродаж.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Стр = ТекущийОбъект.ДействияПоОбращению.Найти(Ложь, "ОтметкаВыполнения");
	
	Если Стр <> Неопределено Тогда
		
		ПараметрыСообщения = Новый Структура;
		ПараметрыСообщения.Вставить("Автор", ПараметрыСеанса.Пользователь);
		ПараметрыСообщения.Вставить("Исполнитель", Стр.Исполнитель);
		ПараметрыСообщения.Вставить("ДатаНачала", Стр.ДатаПланируемая);
		ПараметрыСообщения.Вставить("ДатаОкончания", Стр.ДатаПланируемая);
		ПараметрыСообщения.Вставить("Содержание", Стр.Действие);
		ПараметрыСообщения.Вставить("Комментарий", Стр.Описание);
		ПараметрыСообщения.Вставить("Пояснение", "");
		
		//Если ТипЗнч(Стр.Исполнитель) = Тип("СправочникСсылка.Сотрудники") Тогда
		//	
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	Renault_Задачи.Ссылка
		//	|ИЗ
		//	|	Документ.Renault_Задачи КАК Renault_Задачи
		//	|ГДЕ
		//	|	Renault_Задачи.Автор = &Автор
		//	|	И Renault_Задачи.ВидЗадачи = &ВидЗадачи
		//	|	И Renault_Задачи.Комментарий = &Комментарий
		//	|	И (ВЫРАЗИТЬ(Renault_Задачи.Содержание КАК СТРОКА(500))) = &Содержание
		//	|	И Renault_Задачи.ДокументОснование = &ДокументОснование";
		//	
		//	Запрос.УстановитьПараметр("Автор", ПараметрыСеанса.Пользователь);
		//	Запрос.УстановитьПараметр("ВидЗадачи", Справочники.Renault_ТипыЗадач.ЖалобаКлиента);
		//	Запрос.УстановитьПараметр("ДокументОснование", ТекущийОбъект.Ссылка);
		//	Запрос.УстановитьПараметр("Комментарий", Стр.Описание);
		//	Запрос.УстановитьПараметр("Содержание", Стр.Действие);
		//	
		//	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда Возврат КонецЕсли;
		//	
		//	ПараметрыСообщения.Вставить("Исполнители", Стр.Исполнитель);
		//	ПараметрыСообщения.Вставить("ВидЗадачи", Справочники.Renault_ТипыЗадач.ЖалобаКлиента);
		//	ПараметрыСообщения.Вставить("Содержание", Стр.Действие);
		//	ПараметрыСообщения.Вставить("Приоритет", Перечисления.DMS_ВариантыВажностиЗадачи.Обычная);
		//	ПараметрыСообщения.Вставить("ДокументОснование", ТекущийОбъект.Ссылка);
		//	Renault_РаботаСЗадачами.СоздатьЗадачуRenault(ПараметрыСообщения);
		
		//ИначеЕсли ТипЗнч(Стр.Исполнитель) = Тип("СправочникСсылка.CRM_Отделы") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_СообщенияПользователю.Ссылка
		|ИЗ
		|	Справочник.Renault_СообщенияПользователю КАК Renault_СообщенияПользователю
		|ГДЕ
		|	(ВЫРАЗИТЬ(Renault_СообщенияПользователю.Сообщение КАК СТРОКА(500))) = &Сообщение
		|	И Renault_СообщенияПользователю.Отправитель = &Отправитель
		|	И Renault_СообщенияПользователю.ВидСообщения = &ВидСообщения
		|	И (ВЫРАЗИТЬ(Renault_СообщенияПользователю.Комментарий КАК СТРОКА(500))) = &Комментарий
		|	И Renault_СообщенияПользователю.ИдентификаторОбъекта = &ИдентификаторОбъекта
		|	И НЕ Renault_СообщенияПользователю.Обработано";
		
		Запрос.УстановитьПараметр("ВидСообщения", Справочники.Renault_ВидСообщения.ЖалобаКлиента);
		Запрос.УстановитьПараметр("ИдентификаторОбъекта", Строка(ТекущийОбъект.Ссылка.УникальныйИдентификатор()));
		Запрос.УстановитьПараметр("Комментарий", Стр.Описание);
		Запрос.УстановитьПараметр("Отправитель", ПараметрыСеанса.Пользователь);
		Запрос.УстановитьПараметр("Сообщение", Стр.Действие.Наименование);
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда Возврат КонецЕсли;
		
		Renault_СообщенияПользователю.СоздатьСообщениеПоРаботеСЖалобами(ТекущийОбъект.Ссылка, Справочники.Renault_ВидСообщения.ЖалобаКлиента, ПараметрыСообщения);
		
		//КонецЕсли; 
		
	КонецЕсли;                   
	
КонецПроцедуры
